# დავალება: მომხმარებებელოს შემოატანინეთ range-ის დასაწყისი, საიდან უნდა დაიწყოს დიაპაზონის შექმნა, ასევე დასასრული, და სტეპი, (ანუ ნაბიჯი) , და ეს ჩასვით შემდეგ range-ში და გამოტანეთ რიცხვები.

#დავალება: დაპრინტეთ თქვენი სახელი იმდეჯერ, რამდენი წლისაც ხართ.

#დავალება: შექმენით მხოლოდ ლუწი რიცხვების დიაპაზონი

#დავალება: საკლასო დავალებები ვისაც არ გქონდათ დასრულებული დასრულეთ.

start = int(input("შეიყვანეთ დიაპაზონის დასაწყისი: "))
end = int(input("შეიყვანეთ დიაპაზონის დასასრული: "))
step = int(input("შეიყვანეთ ნაბიჯი (სტეპი): "))

for i in range(start, end , step):
    print(i)



for i in range(11):
    print("nikolozi")


for i in range(0, 102, 2):
    print(i)