// საკლასო დავალება:

// მომხმარებელს შემოატანინეთ propmt-ით რიცხვი, დაბეჭდეთ ის კონსოლში და ასევე დაბეჭდეთ მისი მონაცემთა ტიპი.

// შემდეგ შექმენით ახალი ცვლადი, სადაც უკვე number მონაცემთა ტიპში შეინახავთ ამ ინფორმაციას. დაბეჭდეთ ახალი ცვლადის ინფორმაცია და მისი მონაცემთა ტიპი

let userInput = prompt("გთხოვთ, შეიყვანეთ რიცხვი:");
console.log("მომხმარებლის შეყვანა:", userInput);
console.log("შეყვანილი მონაცემის ტიპი:", typeof userInput);

let numberInput = Number(userInput);
console.log("გარდაქმნილი მნიშვნელობა:", numberInput);
console.log("გარდაქმნილი მონაცემის ტიპი:", typeof numberInput);

